      *=========================================*                       00001006
       IDENTIFICATION                            DIVISION.              00010000
      *=========================================*                       00011006
                                                                        00012006
       PROGRAM-ID.  FR01CB04.                                           00020003
                                                                        00021006
      *=======================================================*         00021106
      *     AUTOR   : IVAN SANCHES                                      00022000
      *     EMPRESA : FOURSYS                                           00023001
      *-------------------------------------------------------*         00023106
      *     DATA   : ZZ/ZZ/ZZZ                                          00024000
      *     OBJETIVO: RECEBER DADOS DA SYSIN                            00025000
      *=======================================================*         00025106
                                                                        00025206
      *=======================================================*         00025306
       ENVIRONMENT                               DIVISION.              00026006
      *=======================================================*         00026106
                                                                        00026206
      *=======================================================*         00026306
       DATA                                      DIVISION.              00027000
      *=======================================================*         00027106
                                                                        00027206
      *---------------------------------------------------              00027306
       WORKING-STORAGE                           SECTION.               00027400
      *---------------------------------------------------              00027506
                                                                        00027606
       01 WRK-DATA.                                                     00027702
          05 WRK-ANO         PIC  9(04) VALUE ZEROS.                    00027801
          05 WRK-MES         PIC  9(02) VALUE ZEROS.                    00027901
          05 WRK-DIA         PIC  9(02) VALUE ZEROS.                    00028001
                                                                        00028106
      *=========================================*                       00028206
       PROCEDURE DIVISION.                                              00028301
      *=========================================*                       00028406
                                                                        00028506
      *---------------------------------------------------              00028606
       0000-PRINCIPAL                     SECTION.                      00028706
      *---------------------------------------------------              00028806
           ACCEPT WRK-DATA FROM DATE YYYYMMDD.                          00028901
           DISPLAY 'DATA ' WRK-DIA ' DO MES ' WRK-MES ' ANO ' WRK-ANO.  00029806
           STOP RUN.                                                    00030006
      *---------------------------------------------------              00040006
       0000-99-FIM.            EXIT.                                    00050006
      *---------------------------------------------------              00060006
                                                                        00061006
      *---------------------------------------------------              00070006
       9000-TRATA-ERROS                  SECTION.                       00080006
      *---------------------------------------------------              00090006
                                                                        00091006
      *--------------------------------------------------------------   00092006
       9000-99-FIM             EXIT.                                    00093006
      *--------------------------------------------------------------   00094006
                                                                        00095006
