       IDENTIFICATION                            DIVISION.              00010000
       PROGRAM-ID.  FR01CB01.                                           00020000
      *=========================================*                       00021000
      *     AUTOR   : IVAN PETRUCCI                                     00022000
      *     EMPRESA : FOURSYS                                           00023000
      *     DATA   : ZZ/ZZ/ZZZ                                          00024000
      *     OBJETIVO: TESTE DE COMPILACAO                               00025000
      *ENVIRONMENT                               DIVISION.              00030000
      *DATA                                      DIVISION.              00040000
       PROCEDURE DIVISION.                                              00050000
           DISPLAY 'MEU PRIMEIRO PROGRAMA - IVAN     '.                 00060000
           STOP RUN.                                                    00070000
