      *=============================================================*   00001000
       IDENTIFICATION                            DIVISION.              00010000
      *=============================================================*   00011000
                                                                        00011100
       PROGRAM-ID. FR01BASE.                                            00012000
                                                                        00012100
      *=============================================================*   00012200
      *   AUTOR...........:                                         *   00012300
      *   DATA ...........:                                         *   00012400
      *   OBJETIVO........:                                         *   00012500
      *=============================================================*   00013600
                                                                        00013700
      *=============================================================*   00013800
       ENVIRONMENT                               DIVISION.              00014000
      *=============================================================*   00015000
                                                                        00015100
      *-------------------------------------------------------------*   00016000
       CONFIGURATION                               SECTION.             00017001
      *-------------------------------------------------------------*   00017100
       SPECIAL-NAMES.                                                   00018001
           DECIMAL-POINT IS COMMA.                                      00019001
                                                                        00020200
      *=============================================================*   00020300
       DATA                                      DIVISION.              00020400
      *=============================================================*   00020500
                                                                        00020600
      *-------------------------------------------------------------*   00020800
       WORKING-STORAGE                             SECTION.             00020901
      *-------------------------------------------------------------*   00021000
                                                                        00022000
      *=============================================================*   00023000
       PROCEDURE DIVISION.                                              00028000
      *=============================================================*   00028100
           STOP RUN.                                                    00030000
