      *====================================================             00010002
       IDENTIFICATION                            DIVISION.              00020002
      *====================================================             00030002
       PROGRAM-ID. FR11CB01.                                            00040002
      *====================================================             00060002
      *  AUTOR: GUSTAVO                                                 00070002
      *  EMPRESA: FOURSYS                                               00080002
      *====================================================             00081002
                                                                        00090002
      *====================================================             00100002
       ENVIRONMENT                               DIVISION.              00110003
      *====================================================             00120002
       CONFIGURATION                            SECTION.                00130002
       SPECIAL-NAMES.                                                   00140002
           DECIMAL-POINT  IS COMMA.                                     00150002
      *====================================================             00160002
       DATA                                      DIVISION.              00170003
      *====================================================             00180002
       WORKING-STORAGE                          SECTION.                00190003
       01 WRK-DADOS.                                                    00200003
          05 WRK-NUMERO        PIC 9(02)     VALUE ZEROS.               00210003
          05 WRK-CONTTIMES     PIC 9(02)     VALUE ZEROS.               00220003
       77 WRK-CONT             PIC 9(02)     VALUE 1.                   00230003
       77 WRK-TOTAL            PIC 9(04)     VALUE ZEROS.               00240003
      *====================================================             00250003
       PROCEDURE                                  DIVISION.             00260003
      *====================================================             00270003
